<?php

namespace Database\Seeders;

use App\Models\KeywordSet;
use Illuminate\Database\Seeder;

class KeywordSetSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        KeywordSet::factory()->createMany([
            [
                'word' => '民眾黨',
                'set' => ['黃國昌', '柯文哲', '民眾黨', '小草', '柯P', '阿北', '藍白', '小草', '白粉', '國蔥', '黃珊珊', '高虹安', '國昌', '白藍', '陳昭姿', '阿伯', '狗昌', '柯粉'],
            ],
            [
                'word' => '民進黨',
                'set' => ['民進黨', '蔡英文', '賴清德', '綠營', '高嘉瑜', '綠粉', '黃捷', '青鳥', '青島東路', '綠共', '抗議', '陳亭妃' ,'吳崢','憨鳥', '高端', '小英', '柯建銘', '陳水扁', '統神','沈伯洋', '吳思瑤', '許智傑', '唐鳳' ,'沈富雄', '王必勝', '林智堅', '小綠', '蔡易餘', '黑熊學院', '塔綠班', '陳俊翰', '林靜儀'],

            ],
            [
                'word' => '國民黨',
                'set' => ['國民黨', '侯友宜', '徐巧芯', '藍營', '韓國瑜', '王世堅', '蔣萬安', '朱立倫', '藍粉', '王鴻薇', '立法院長', '馬英九' ,'葉元之', '陳玉珍', '白藍', '傅崑其', '巧芯', '韓院長', '盧媽', '盧秀燕', '洽吉', '王世堅', '謝國樑'],
            ]
        ]);
    }
}
